UAS/app/Models/BookModel.php

SELECT `books`.*, COALESCE(AVG(reviews.rating), 0) AS average_rating
FROM `books`
LEFT JOIN `reviews` ON `books`.`id` = `reviews`.`book_id`
GROUP BY `books`.`id`
---
    public function getAllBooksWithRating()
    {
        $builder = $this->db->table('books');
        $builder->select('books.*, COALESCE(AVG(reviews.rating), 0) AS average_rating');
        $builder->join('reviews', 'books.id = reviews.book_id', 'left');
        $builder->groupBy('books.id');
        return $builder->get()->getResultArray();

SELECT *
FROM `books`
WHERE `books`.`id` = '1'
---
    public function getBookById($id)
    {
        return $this->find($id);