UAS/app/Models/OptionModel.php

SELECT *
FROM `options`
WHERE `question_id` = '1'
---
    public function getOptionsByQuestionId($questionId)
    {
        return $this->where('question_id', $questionId)->findAll();