UAS/app/Models/QuestionModel.php

    public function getAllQuestions()
    {
        return $this->findAll();
---
SELECT *
FROM `questions`

    public function getQuestionWithOptions($questionNumber)
    {
        $questions = $this->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `questions`
ORDER BY `id` ASC