UAS/app/Models/TestAnswerModel.php

SELECT *
FROM `test_answers`
WHERE `test_id` = 27
---
    public function getAnsweredQuestions($testId)
    {
        $answers = $this->where('test_id', $testId)->findAll();

SELECT *
FROM `test_answers`
WHERE `test_id` = '54'
---
    public function getAnswersByTestId($testId)
    {
        return $this->where('test_id', $testId)->findAll();