UAS/app/Controllers/AuthController.php

    public function authenticate()
    {
        // Validasi input
        if (!$this->validate([
            'email'    => 'required|valid_email',
            'password' => 'required',
        ])) {
            return redirect()->back()->withInput()->with('validation', $this->validator);
        }

        // Mendapatkan data pengguna berdasarkan email menggunakan UserModel
        $user = $this->userModel->where('email', $this->request->getPost('email'))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'lol@gmail.com'
 LIMIT 1