UAS/app/Controllers/BookFormulasController.php

    public function index()
    {
        try {
            $formulas = $this->bookFormulasModel->findAll();
---
SELECT *
FROM `book_formulas`