UAS/app/Controllers/Books.php

SELECT AVG(rating) as average_rating
FROM `reviews`
WHERE `book_id` = '1'
 LIMIT 1
SELECT `reviews`.*, `users`.`name` as `reviewer_name`
FROM `reviews`
JOIN `users` ON `reviews`.`user_id` = `users`.`id`
WHERE `reviews`.`book_id` = '1'
---
    public function show($id)
    {
        $book = $this->bookModel->getBookById($id);

        if (!$book) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Book not found');
        }

        // Hitung rata-rata rating
        $averageRating = $this->reviewModel->select('AVG(rating) as average_rating')
                                        ->where('book_id', $id)
                                        ->first()['average_rating'];

        $book['average_rating'] = $averageRating ? round($averageRating, 1) : 0;

        $reviews = $this->reviewModel->select('reviews.*, users.name as reviewer_name')
                                    ->join('users', 'reviews.user_id = users.id')
                                    ->where('reviews.book_id', $id)
                                    ->findAll();