UAS/app/Controllers/ForumController.php

    public function index()
    {
        $session = session();
        $user = $session->get('user'); // Ambil data user dari session

        if (!$user) {
            return redirect()->to('/login')->with('error', 'Anda harus login untuk mengakses halaman ini.');
        }

        // Ambil semua pertanyaan beserta username dan jawaban terkait
        $questions = $this->questionModel
            ->select('forumquestion.*, users.username AS question_username')
            ->join('users', 'users.id = forumquestion.user_id')
            ->orderBy('forumquestion.created_at', 'DESC')
            ->findAll();

        foreach ($questions as &$question) {
            $question['answers'] = $this->answerModel
                ->select('forumanswer.*, users.username AS answer_username')
                ->join('users', 'users.id = forumanswer.user_id')
                ->where('forumanswer.question_id', $question['id'])
                ->findAll();
---
SELECT `forumquestion`.*, `users`.`username` AS `question_username`
FROM `forumquestion`
JOIN `users` ON `users`.`id` = `forumquestion`.`user_id`
ORDER BY `forumquestion`.`created_at` DESC
SELECT `forumanswer`.*, `users`.`username` AS `answer_username`
FROM `forumanswer`
JOIN `users` ON `users`.`id` = `forumanswer`.`user_id`
WHERE `forumanswer`.`question_id` = '8'