UAS/app/Controllers/TestController.php

SELECT *
FROM `tests`
WHERE `tests`.`id` = 27
SELECT COUNT(*) AS `numrows` FROM `questions`
SELECT *
FROM `test_answers`
WHERE `test_id` = 27
AND `question_id` = '1'
 LIMIT 1
---
    public function simulate($questionNumber)
    {
        // $user = $this->validateToken();
        // if (!$user) {
        //     return $this->response->setStatusCode(401)->setJSON(['status' => 'error', 'message' => 'Unauthorized']);
        // }

        $session = session();
        $testId = $session->get('test_id');

        if (!$testId) {
            return redirect()->to('/test/start')->with('error', 'Tes tidak ditemukan.');
        }

        $test = $this->testModel->find($testId);
        if (!$test) {
            return redirect()->to('/test/start')->with('error', 'Tes tidak ditemukan.');
        }

        $question = $this->questionModel->getQuestionWithOptions($questionNumber);
        if (!$question) {
            return redirect()->to('/test/progress')->with('error', 'Soal tidak ditemukan.');
        }

        $options = $this->optionModel->getOptionsByQuestionId($question['id']);
        $total = $this->questionModel->countAll();
        $answered = $this->testAnswerModel->getAnsweredQuestions($testId);
        $existingAnswer = $this->testAnswerModel->where([
            'test_id' => $testId,
            'question_id' => $question['id']
        ])->first();

SELECT *
FROM `options`
WHERE `question_id` = '4'
AND `is_correct` = 1
 LIMIT 1
---
    public function submit_single()
    {
        // $user = $this->validateToken();
        // if (!$user) {
        //     return $this->response->setStatusCode(401)->setJSON(['status' => 'error', 'message' => 'Unauthorized']);
        // }

        // Validasi input
        if (!$this->validate([
            'selected_option_id' => 'required|integer',
            'question_id' => 'required|integer',
            'current' => 'required|integer',
            'total' => 'required|integer',
            'test_id' => 'required|integer'
        ])) {
            return redirect()->back()->withInput()->with('validation', $this->validator);
        }

        // Mendapatkan data dari form
        $selectedOptionId = $this->request->getPost('selected_option_id');
        $questionId = $this->request->getPost('question_id');
        $current = (int)$this->request->getPost('current');
        $total = (int)$this->request->getPost('total');
        $testId = (int)$this->request->getPost('test_id');

        // Mendapatkan user dari session
        $session = session();

        // Cek apakah jawaban benar
        $correctOption = $this->optionModel->where('question_id', $questionId)
                                        ->where('is_correct', 1)
                                        ->first();

SELECT *
FROM `test_answers`
WHERE `test_id` = 54
AND `question_id` = '4'
 LIMIT 1
---
        $isCorrect = ($correctOption && $correctOption['id'] == $selectedOptionId) ? 1 : 0;

        // Simpan jawaban ke database
        $existingAnswer = $this->testAnswerModel->where([
            'test_id' => $testId,
            'question_id' => $questionId
        ])->first();

INSERT INTO `test_answers` (`test_id`, `question_id`, `selected_option_id`, `is_correct`) VALUES (54, '4', '16', 1)
---
            ]);
        } else {
            // Tambahkan jawaban baru
            $this->testAnswerModel->insert([
                'test_id' => $testId,
                'question_id' => $questionId,
                'selected_option_id' => $selectedOptionId,
                'is_correct' => $isCorrect
            ]);

SELECT *
FROM `tests`
WHERE `tests`.`id` = '54'
SELECT *
FROM `questions`
WHERE `questions`.`id` = '1'
SELECT *
FROM `options`
WHERE `options`.`id` = '1'
SELECT *
FROM `options`
WHERE `question_id` = '1'
AND `is_correct` = 1
 LIMIT 1
---
    public function result($testId)
    {
        // $user = $this->validateToken();
        // if (!$user) {
        //     return $this->response->setStatusCode(401)->setJSON(['status' => 'error', 'message' => 'Unauthorized']);
        // }

        $session = session();
        $user = $session->get('user');

        if (!$user) {
            return redirect()->to('/login')->with('error', 'Anda harus login terlebih dahulu.');
        }

        // Pastikan test_id valid dan milik user saat ini
        $test = $this->testModel->find($testId);
        if (!$test || $test['user_id'] != $user->user_id) {
            return redirect()->to('/test/start')->with('error', 'Tes tidak ditemukan atau Anda tidak berhak mengaksesnya.');
        }

        // Ambil semua jawaban untuk tes ini
        $testAnswers = $this->testAnswerModel->getAnswersByTestId($testId);

        // Ambil informasi terperinci untuk setiap jawaban
        $detailedAnswers = [];
        foreach ($testAnswers as $answer) {
            $question = $this->questionModel->find($answer['question_id']);
            $selectedOption = $this->optionModel->find($answer['selected_option_id']);
            $correctOption = $this->optionModel->where('question_id', $answer['question_id'])->where('is_correct', 1)->first();

SELECT *
FROM `tests`
WHERE `user_id` = 4
SELECT COUNT(*) AS `numrows` FROM `questions`
---
    public function progress()
    {
        // $user = $this->validateToken();
        // if (!$user) {
        //     return $this->response->setStatusCode(401)->setJSON(['status' => 'error', 'message' => 'Unauthorized']);
        // }

        $session = session();
        $user = $session->get('user');

        if (!$user) {
            return redirect()->to('/login')->with('error', 'Anda harus login terlebih dahulu.');
        }

        // Mendapatkan semua tes yang diambil oleh user
        $tests = $this->testModel->where('user_id', $user->user_id)->findAll();

        // Mendapatkan total jumlah soal (dari tabel questions)
        $total = $this->questionModel->countAll();